____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
input_1 (InputLayer)             (None, 44, 115)       0                                            
____________________________________________________________________________________________________
reshape_1 (Reshape)              (None, 44, 115, 1)    0           input_1[0][0]                    
____________________________________________________________________________________________________
batchnormalization_1 (BatchNormal(None, 44, 115, 1)    2           reshape_1[0][0]                  
____________________________________________________________________________________________________
convolution2d_1 (Convolution2D)  (None, 44, 115, 32)   320         batchnormalization_1[0][0]       
____________________________________________________________________________________________________
batchnormalization_2 (BatchNormal(None, 44, 115, 32)   64          convolution2d_1[0][0]            
____________________________________________________________________________________________________
elu_1 (ELU)                      (None, 44, 115, 32)   0           batchnormalization_2[0][0]       
____________________________________________________________________________________________________
convolution2d_2 (Convolution2D)  (None, 44, 115, 32)   9248        elu_1[0][0]                      
____________________________________________________________________________________________________
batchnormalization_3 (BatchNormal(None, 44, 115, 32)   64          convolution2d_2[0][0]            
____________________________________________________________________________________________________
elu_2 (ELU)                      (None, 44, 115, 32)   0           batchnormalization_3[0][0]       
____________________________________________________________________________________________________
maxpooling2d_1 (MaxPooling2D)    (None, 22, 57, 32)    0           elu_2[0][0]                      
____________________________________________________________________________________________________
dropout_1 (Dropout)              (None, 22, 57, 32)    0           maxpooling2d_1[0][0]             
____________________________________________________________________________________________________
convolution2d_3 (Convolution2D)  (None, 22, 57, 64)    18496       dropout_1[0][0]                  
____________________________________________________________________________________________________
batchnormalization_4 (BatchNormal(None, 22, 57, 64)    128         convolution2d_3[0][0]            
____________________________________________________________________________________________________
elu_3 (ELU)                      (None, 22, 57, 64)    0           batchnormalization_4[0][0]       
____________________________________________________________________________________________________
convolution2d_4 (Convolution2D)  (None, 22, 57, 64)    36928       elu_3[0][0]                      
____________________________________________________________________________________________________
batchnormalization_5 (BatchNormal(None, 22, 57, 64)    128         convolution2d_4[0][0]            
____________________________________________________________________________________________________
elu_4 (ELU)                      (None, 22, 57, 64)    0           batchnormalization_5[0][0]       
____________________________________________________________________________________________________
maxpooling2d_2 (MaxPooling2D)    (None, 11, 28, 64)    0           elu_4[0][0]                      
____________________________________________________________________________________________________
dropout_2 (Dropout)              (None, 11, 28, 64)    0           maxpooling2d_2[0][0]             
____________________________________________________________________________________________________
convolution2d_5 (Convolution2D)  (None, 11, 28, 64)    36928       dropout_2[0][0]                  
____________________________________________________________________________________________________
batchnormalization_6 (BatchNormal(None, 11, 28, 64)    128         convolution2d_5[0][0]            
____________________________________________________________________________________________________
elu_5 (ELU)                      (None, 11, 28, 64)    0           batchnormalization_6[0][0]       
____________________________________________________________________________________________________
convolution2d_6 (Convolution2D)  (None, 11, 28, 64)    36928       elu_5[0][0]                      
____________________________________________________________________________________________________
batchnormalization_7 (BatchNormal(None, 11, 28, 64)    128         convolution2d_6[0][0]            
____________________________________________________________________________________________________
elu_6 (ELU)                      (None, 11, 28, 64)    0           batchnormalization_7[0][0]       
____________________________________________________________________________________________________
maxpooling2d_3 (MaxPooling2D)    (None, 5, 14, 64)     0           elu_6[0][0]                      
____________________________________________________________________________________________________
dropout_3 (Dropout)              (None, 5, 14, 64)     0           maxpooling2d_3[0][0]             
____________________________________________________________________________________________________
convolution2d_7 (Convolution2D)  (None, 5, 14, 64)     36928       dropout_3[0][0]                  
____________________________________________________________________________________________________
batchnormalization_8 (BatchNormal(None, 5, 14, 64)     128         convolution2d_7[0][0]            
____________________________________________________________________________________________________
elu_7 (ELU)                      (None, 5, 14, 64)     0           batchnormalization_8[0][0]       
____________________________________________________________________________________________________
convolution2d_8 (Convolution2D)  (None, 5, 14, 64)     36928       elu_7[0][0]                      
____________________________________________________________________________________________________
batchnormalization_9 (BatchNormal(None, 5, 14, 64)     128         convolution2d_8[0][0]            
____________________________________________________________________________________________________
elu_8 (ELU)                      (None, 5, 14, 64)     0           batchnormalization_9[0][0]       
____________________________________________________________________________________________________
maxpooling2d_4 (MaxPooling2D)    (None, 2, 7, 64)      0           elu_8[0][0]                      
____________________________________________________________________________________________________
dropout_4 (Dropout)              (None, 2, 7, 64)      0           maxpooling2d_4[0][0]             
____________________________________________________________________________________________________
flatten_1 (Flatten)              (None, 896)           0           dropout_4[0][0]                  
____________________________________________________________________________________________________
dense_1 (Dense)                  (None, 7)             6279        flatten_1[0][0]                  
____________________________________________________________________________________________________
batchnormalization_10 (BatchNorma(None, 7)             14          dense_1[0][0]                    
____________________________________________________________________________________________________
activation_1 (Activation)        (None, 7)             0           batchnormalization_10[0][0]      
====================================================================================================
Total params: 219895
____________________________________________________________________________________________________
